InformationRegisters/Renault_ЦентрализованныеРассылки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>Renault_ЦентрализованныеРассылки</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НазваниеКампании</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРассылки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.CRM_ПотенциальныеКонтрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/Renault_ЦентрализованныеОпросы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>Renault_ЦентрализованныеОпросы</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТипПродукта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончанияДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерКартыПродленнойГарантии</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/Renault_ЦентрализованныеПродукты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>Renault_ЦентрализованныеПродукты</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.CRM_ПотенциальныеКонтрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>VIN</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаДействияГарантии</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончанияДействияГарантии</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончанияДействияПродленнойГарантии</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПродажиКарты</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Стоимость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерКарты</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПробегНаДатуПродажиКарты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипКарты</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Действующая</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВыдачиКредита</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаКредита</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

CommonModules/Renault_ЗагрузкаКлиентскихДанных/Ext/Module.bsl
Функция ПолучитьПрокси()
	
	Настройки = Справочники.Renault_СлужебныеНастройкиБазыДанных[ПараметрыСеанса.DMS_Бренд.Наименование];
	
	// Сериализация полученной таблицы и передача ее в web-сервис
	Адрес = Настройки.АдресWsGate + "ws/ClientsInfo.ws?wsdl";
	ПарольWS = Настройки.ПарольДоступаКВебСервисам;
	ЛогинWS = Настройки.ЛогинДоступаКВебСервисам;
	ОпределениеСервиса = Новый WSОпределения(Адрес, ЛогинWS, ПарольWS);
	ВебСервис = Новый WSПрокси(
		ОпределениеСервиса, 
		"http://renault-nissan.com/schema/ClientsInfo", // ПРОВЕРИТЬ 
		"Renault_ClientsInfo",
		"Renault_ClientsInfoSoap12",
		3600);
	ВебСервис.Пользователь	 = ЛогинWS;
	ВебСервис.Пароль		 = ПарольWS;
	
	Возврат ВебСервис;
	                         
КонецФункции

Процедура Renault_ЗагрузкаКлиентскихДанных() Экспорт
		
	ДатаАктуальности = Константы.Renault_ДатаАктуальностиЦентрализованныхКлиентскихДанных.Получить();
	ВебСервис = ПолучитьПрокси();
	Server = СтрокаСоединенияИнформационнойБазы();
	BIR = Константы.Renault_BIR_db.Получить();
	
	//ЗагрузитьРассылки(ВебСервис, ДатаАктуальности, Server, BIR);
	//ЗагрузитьОпросы(ВебСервис, ДатаАктуальности, Server, BIR);
	ЗагрузитьПродукты(ВебСервис, ДатаАктуальности, Server, BIR);
	
КонецПроцедуры

Процедура ЗагрузитьРассылки(ВебСервис, ДатаАктуальности, Server, BIR)
	
	СериализованнаяТаблицаРассылок = ВебСервис.GetCampainsInfo(ДатаАктуальности, Server, BIR); //ДОПОЛНИТЬ
	
	Фабрика = ВебСервис.ФабрикаXDTO;
	Сериализатор = Новый СериализаторXDTO(Фабрика);
	ТаблицаРассылок = Сериализатор.ПрочитатьXDTO(СериализованнаяТаблицаРассылок);
	
	Для Каждого Строка Из ТаблицаРассылок Цикл		
				
		Запись = РегистрыСведений.Renault_ЦентрализованныеРассылки.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(Запись, Строка);
		Запись.Записать();
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗагрузитьОпросы(ВебСервис, ДатаАктуальности, Server, BIR)
	
	СериализованнаяТаблицаОпросов = ВебСервис.GetSurveysInfo(ДатаАктуальности, Server, BIR); //ДОПОЛНИТЬ
	
	Фабрика = ВебСервис.ФабрикаXDTO;
	Сериализатор = Новый СериализаторXDTO(Фабрика);
	ТаблицаОпросов = Сериализатор.ПрочитатьXDTO(СериализованнаяТаблицаОпросов);
	
	Для Каждого Строка Из ТаблицаОпросов Цикл		
				
		Запись = РегистрыСведений.Renault_ЦентрализованныеОпросы.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(Запись, Строка);
		Запись.Записать();
		
	КонецЦикла;

КонецПроцедуры

Процедура ЗагрузитьПродукты(ВебСервис, ДатаАктуальности, Server, BIR)
	
	СериализованнаяТаблицаПродуктов = ВебСервис.GetProductsInfo(ДатаАктуальности, Server, BIR); //ДОПОЛНИТЬ
	
	Фабрика = ВебСервис.ФабрикаXDTO;
	Сериализатор = Новый СериализаторXDTO(Фабрика);
	ТаблицаПродуктов = Сериализатор.ПрочитатьXDTO(СериализованнаяТаблицаПродуктов);
	
	Для Каждого Строка Из ТаблицаПродуктов Цикл		
				
		Запись = РегистрыСведений.Renault_ЦентрализованныеПродукты.СоздатьМенеджерЗаписи();
		Запись.Идентификатор = Строка.garantee_id;
		 
		ИдентификаторКлиента = Новый УникальныйИдентификатор(Строка.dms_client_id);
		СсылкаНаКлиента = Справочники.Контрагенты.ПолучитьСсылку(ИдентификаторКлиента);
		Если Не ЗначениеЗаполнено(СсылкаНаКлиента.ПолучитьОбъект()) Тогда
			СсылкаНаКлиента = Справочники.CRM_ПотенциальныеКонтрагенты.ПолучитьСсылку(ИдентификаторКлиента);
		КонецЕсли;
		Если ЗначениеЗаполнено(СсылкаНаКлиента) Тогда
			Запись.Клиент = СсылкаНаКлиента;
		КонецЕсли;
		
		Запись.VIN = Строка.vin;
		Запись.ДатаНачалаДействияГарантии = Строка.gar_start_date_Formated;
		Запись.ДатаОкончанияДействияГарантии = Строка.gar_end_date_Formated;
		Запись.ДатаОкончанияДействияПродленнойГарантии = Строка.ext_gar_end_date_Formated;
		Запись.ДатаПродажиКарты = Строка.contract_date_Formated;
		Запись.Стоимость = Строка.cost;
		Запись.НомерКарты = Строка.card;
		Запись.ПробегНаДатуПродажиКарты = Строка.run;
		Если Строка.type = 1 Тогда
			Запись.ТипКарты = "Пр.гарантия";
		ИначеЕсли Строка.type = 2 Тогда
			Запись.ТипКарты = "SARA";
		ИначеЕсли Строка.type = 3 Тогда
			Запись.ТипКарты = "Кредит RN-Банка";
		КонецЕсли;			
		Запись.Действующая = Строка.active;
		
		Запись.СуммаКредита = Строка.Loan_Amount_Total;		
		Запись.ДатаВыдачиКредита = Строка.Date_Agreement;
				
		Запись.Записать();
		
	КонецЦикла;

КонецПроцедуры
